let id = 1;

let samplePerson = {
    "処理結果": "0",
    "個人": {
        "カメラ": {
            "user1": {
                "目標": "100",
                "進捗本数": "60",
                "進捗割合": "30",
                "順位": "1"
            },
            "user2": {
                "目標": "100",
                "進捗本数": "20",
                "進捗割合": "20",
                "順位": "2"
            },
            "user3": {
                "目標": "100",
                "進捗本数": "10",
                "進捗割合": "10",
                "順位": "3"
            }
        },
        "残置線": {
            "user1": {
                "目標": "200",
                "進捗本数": "60",
                "進捗割合": "30",
                "順位": "1"
            },
            "user2": {
                "目標": "200",
                "進捗本数": "40",
                "進捗割合": "20",
                "順位": "2"
            },
            "user3": {
                "目標": "200",
                "進捗本数": "20",
                "進捗割合": "10",
                "順位": "3"
            }
        }
       
    }
};

let sampleTeam = {
    "処理結果": "0",
    "チーム": {
        "カメラ": {
            "A": {
                "目標": "200",
                "進捗本数": "40",
                "進捗割合": "20",
                "順位": "1",
            },
            "B": {
                "目標": "200",
                "進捗本数": "20",
                "進捗割合": "10",
                "順位": "2",
            }
        },
        "残置線": {
            "A": {
                "目標": "200",
                "進捗本数": "40",
                "進捗割合": "20",
                "順位": "1",
            },
            "B": {
                "目標": "200",
                "進捗本数": "20",
                "進捗割合": "10",
                "順位": "2",
            }
        }
    },
    "個人": {
        "user1": {
            "カメラ": {
                "チームID": "A",
                "目標": "200",
                "進捗本数": "40",
                "進捗割合": "20",
                "順位": "1",
                "貢献度": "10"
            },
            "残置線": {
                "チームID": "A",
                "目標": "200",
                "進捗本数": "40",
                "進捗割合": "20",
                "順位": "1",
                "貢献度": "10"
            }
        },
        "user2": {
            "カメラ": {
                "チームID": "B",
                "目標": "200",
                "進捗本数": "20",
                "進捗割合": "10",
                "順位": "2",
                "貢献度": "5"
            },
            "残置線": {
                "チームID": "B",
                "目標": "200",
                "進捗本数": "20",
                "進捗割合": "10",
                "順位": "2",
                "貢献度": "5"
            }
        }
    }
};